In [21]:
#In this lab, I used sqlite to create table, view and index

#installing packages
!pip install ipython-sql
!pip install prettytable
%load_ext sql

Requirement already satisfied: ipython-sql in c:\users\user\anaconda3\lib\site-packages (0.5.0)
Requirement already satisfied: prettytable in c:\users\user\anaconda3\lib\site-packages (from ipython-sql) (3.12.0)
Requirement already satisfied: ipython in c:\users\user\anaconda3\lib\site-packages (from ipython-sql) (8.25.0)
Requirement already satisfied: sqlalchemy>=2.0 in c:\users\user\anaconda3\lib\site-packages (from ipython-sql) (2.0.30)
Requirement already satisfied: sqlparse in c:\users\user\anaconda3\lib\site-packages (from ipython-sql) (0.5.2)
Requirement already satisfied: six in c:\users\user\anaconda3\lib\site-packages (from ipython-sql) (1.16.0)
Requirement already satisfied: ipython-genutils in c:\users\user\anaconda3\lib\site-packages (from ipython-sql) (0.2.0)
Requirement already satisfied: typing-extensions>=4.6.0 in c:\users\user\anaconda3\lib\site-packages (from sqlalchemy>=2.0->ipython-sql) (4.11.0)
Requirement already satisfied: greenlet!=0.4.17 in c:\users\user\anaconda3\lib\site-packages (from sqlalchemy>=2.0->ipython-sql) (3.0.1)
Requirement already satisfied: decorator in c:\users\user\anaconda3\lib\site-packages (from ipython->ipython-sql) (5.1.1)
Requirement already satisfied: jedi>=0.16 in c:\users\user\anaconda3\lib\site-packages (from ipython->ipython-sql) (0.18.1)
Requirement already satisfied: matplotlib-inline in c:\users\user\anaconda3\lib\site-packages (from ipython->ipython-sql) (0.1.6)
Requirement already satisfied: prompt-toolkit<3.1.0,>=3.0.41 in c:\users\user\anaconda3\lib\site-packages (from ipython->ipython-sql) (3.0.43)
Requirement already satisfied: pygments>=2.4.0 in c:\users\user\anaconda3\lib\site-packages (from ipython->ipython-sql) (2.15.1)
Requirement already satisfied: stack-data in c:\users\user\anaconda3\lib\site-packages (from ipython->ipython-sql) (0.2.0)
Requirement already satisfied: traitlets>=5.13.0 in c:\users\user\anaconda3\lib\site-packages (from ipython->ipython-sql) (5.14.3)
Requirement already satisfied: colorama in c:\users\user\anaconda3\lib\site-packages (from ipython->ipython-sql) (0.4.6)
Requirement already satisfied: wcwidth in c:\users\user\anaconda3\lib\site-packages (from prettytable->ipython-sql) (0.2.5)
Requirement already satisfied: parso<0.9.0,>=0.8.0 in c:\users\user\anaconda3\lib\site-packages (from jedi>=0.16->ipython->ipython-sql) (0.8.3)
Requirement already satisfied: executing in c:\users\user\anaconda3\lib\site-packages (from stack-data->ipython->ipython-sql) (0.8.3)
Requirement already satisfied: asttokens in c:\users\user\anaconda3\lib\site-packages (from stack-data->ipython->ipython-sql) (2.0.5)
Requirement already satisfied: pure-eval in c:\users\user\anaconda3\lib\site-packages (from stack-data->ipython->ipython-sql) (0.2.2)
Requirement already satisfied: prettytable in c:\users\user\anaconda3\lib\site-packages (3.12.0)
Requirement already satisfied: wcwidth in c:\users\user\anaconda3\lib\site-packages (from prettytable) (0.2.5)
The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [22]:
#importing packages
import pandas as pd
import sqlite3
import prettytable

In [23]:
#connecting sqlite to a database
conn = sqlite3.connect('sales.db')
cur = conn.cursor()
prettytable.DEFAULT='DEFAULT'

In [59]:
#CREATING TABLE
    
%sql DROP TABLE IF EXISTS 'products';
%sql CREATE TABLE products(id INTEGER PRIMARY KEY,\
name TEXT NOT NULL,\
category TEXT NOT NULL,\
price REAL NOT NULL,\
stock_quantity INTEGER NOT NULL);

%sql INSERT INTO products (name, category, price, stock_quantity)\
VALUES('Smartphone', 'Electronics', 699.99, 150),\
('Laptop', 'Electronics', 999.99, 85),\
('Sneakers', 'Footwear', 89.99, 200),\
('Running Shoes', 'Footwear', 129.99, 120),\
('Blender', 'Home Appliances', 49.99, 60);

 * sqlite:///sales.db
Done.
 * sqlite:///sales.db
Done.
 * sqlite:///sales.db
5 rows affected.

[]

In [60]:
%sql SELECT *\
FROM products;

 * sqlite:///sales.db
Done.

[(1, 'Smartphone', 'Electronics', 699.99, 150),
 (2, 'Laptop', 'Electronics', 999.99, 85),
 (3, 'Sneakers', 'Footwear', 89.99, 200),
 (4, 'Running Shoes', 'Footwear', 129.99, 120),
 (5, 'Blender', 'Home Appliances', 49.99, 60)]

In [61]:
#CREATING VIEWS
%sql DROP VIEW IF EXISTS 'low_stock_products';
%sql CREATE VIEW low_stock_products AS\
SELECT id,name,category,price,stock_quantity FROM products\
WHERE stock_quantity < 100;

 * sqlite:///sales.db
Done.
 * sqlite:///sales.db
Done.

[]

In [55]:
%sql SELECT *\
FROM low_stock_products;

 * sqlite:///sales.db
Done.

[(2, 'Laptop', 'Electronics', 999.99, 85),
 (5, 'Blender', 'Home Appliances', 49.99, 60)]

In [64]:
#CREATING INDEX
%sql CREATE INDEX ind_cat ON products(category);

 * sqlite:///sales.db
Done.

[]

In [65]:
%sql SELECT * FROM products WHERE category = 'Footwear';

 * sqlite:///sales.db
Done.

[(3, 'Sneakers', 'Footwear', 89.99, 200),
 (4, 'Running Shoes', 'Footwear', 129.99, 120)]